Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: `quarkus-oidc` and `quarkus-smallrye-jwt` support the JWT and opaque token injection into the endpoint code. Injected JWT tokens provide more information about the user. All extensions can have the tokens injected as `Principal`.
ja_jp: `quarkus-oidc` と `quarkus-smallrye-jwt` は、エンドポイントコードへの JWT と不透明トークンの注入をサポートします。 注入された JWT トークンは、ユーザーに関する詳細情報を提供します。 すべてのエクステンションには、トークンを `Principal` として注入できます。

source: `quarkus-oidc` and `quarkus-smallrye-jwt` support the injecting of JWT and opaque tokens into the endpoint code. Injected JWT tokens provide more information about the user. All extensions can have the tokens injected as `Principal`.
ja_jp: `quarkus-oidc` と `quarkus-smallrye-jwt` は、エンドポイントのコードに JWT と opaque トークンを注入することをサポートしています。注入されたJWTトークンは、ユーザーに関するより多くの情報を提供します。すべてのエクステンションは、 `Principal` として注入されたトークンを持つことができます。

source: `quarkus-oidc` can be configured as follows to support `MTLS`:
ja_jp: `quarkus-oidc` は、以下のように構成することで、 `MTLS` に対応することができます：

source: `quarkus-oidc` can be configured as follows to support `mTLS`:
ja_jp: `quarkus-oidc` は、 `mTLS` をサポートするように次のように設定できます。

source: `quarkus-oidc` extension provides a reactive, interoperable, multi-tenant enabled OpenID Connect adapter which supports `Bearer Token` and `Authorization Code Flow` authentication mechanisms.
ja_jp: `quarkus-oidc` エクステンションは、 `Bearer Token` および `Authorization Code Flow` 認証メカニズムをサポートする、リアクティブで相互運用可能なマルチテナント対応の OpenID Connect アダプターを提供します。

source: `quarkus-oidc` extension requires an OpenID Connect provider such as Keycloak which can be used to verify the Bearer tokens or authenticate the end users with the Authorization Code flow. In both cases `quarkus-oidc` requires a connection to this OpenID Connect provider.
ja_jp: `quarkus-oidc` エクステンションには、Keycloak のような OpenID Connect プロバイダーが必要で、これは Bearer トークンの検証や Authorization Code Flow によるエンドユーザーの認証に使用することができます。どちらの場合も、 `quarkus-oidc` は、この OpenID Connect プロバイダーへの接続を必要とします。

source: `quarkus-oidc` is the only option when the user authentication via Authorization Code flow or supporting multiple tenants is required. It can also request a UserInfo using both Authorization Code Flow and Bearer access tokens.
ja_jp: `quarkus-oidc` は、Authorization Code フローによるユーザー認証や、複数のテナントへの対応が必要な場合の唯一の選択肢です。また、Authorization Code FlowとBearerアクセストークンの両方を使ってUserInfoを要求することもできます。

source: `quarkus-oidc` prioritizes on letting users meet most of requirements without having to write custom code, while also letting users customize and filter different parts of the OIDC flows. But the OIDC and OAuth2 space is huge and supporting many of required combinations with configuration propertes has its cost.
ja_jp: `quarkus-oidc` は、ユーザーがカスタムコードを書かずにほとんどの要件を満たせるようにすることを優先し、同時に OIDC フローのさまざまな部分をカスタマイズしたりフィルターしたりすることも可能にします。しかし、OIDC および OAuth2 の領域は広大であり、必要な多くの組み合わせを設定プロパティーでサポートすることには相応のコストが伴います。

source: `quarkus-oidc` provides `quarkus.oidc.TokenIntrospectionCache` and `quarkus.oidc.UserInfoCache` interfaces which can be used to implement `@ApplicationScoped` cache implementation which can be used to store and retrieve `quarkus.oidc.TokenIntrospection` and/or `quarkus.oidc.UserInfo` objects, for example:
ja_jp: `quarkus-oidc` は `quarkus.oidc.TokenIntrospectionCache` と `quarkus.oidc.UserInfoCache` インターフェイスを提供します。これらは `@ApplicationScoped` キャッシュ実装を実装するために使用できます。これらは `quarkus.oidc.TokenIntrospection` や `quarkus.oidc.UserInfo` オブジェクトを取得および保存するのに使用できます。以下に例を示します。

source: `quarkus-oidc` provides `quarkus.oidc.TokenIntrospectionCache` and `quarkus.oidc.UserInfoCache` interfaces, usable for `@ApplicationScoped` cache implementation. Use `@ApplicationScoped` cache implementation to store and retrieve `quarkus.oidc.TokenIntrospection` and/or `quarkus.oidc.UserInfo` objects, as outlined in the following example:
ja_jp: `quarkus-oidc` は、 `quarkus.oidc.TokenIntrospectionCache` および `quarkus.oidc.UserInfoCache` インターフェイスを提供します。 これらは `@ApplicationScoped` キャッシュ実装に使用できます。次の例に示すように、 `@ApplicationScoped` キャッシュ実装を使用して、 `quarkus.oidc.TokenIntrospection` オブジェクトや `quarkus.oidc.UserInfo` オブジェクトを保存および取得します。

source: `quarkus-oidc` requires an OpenID Connect provider such as Keycloak, which can be used to verify the Bearer tokens or authenticate the end users with the Authorization Code flow. In both cases, `quarkus-oidc` requires a connection to the specified OpenID Connect provider.
ja_jp: `quarkus-oidc` は、KeycloakのようなOpenID Connectプロバイダを必要とします。このプロバイダは、ベアラートークンの検証や、認可コードフローによるエンドユーザの認証に使用できます。 どちらの場合も、 `quarkus-oidc` は指定されたOpenID Connectプロバイダへの接続が必要です。

source: `quarkus-oidc` requires an OpenID Connect provider such as Keycloak, which can verify the bearer tokens or authenticate the end users with the Authorization Code flow. In both cases, `quarkus-oidc` requires a connection to the specified OpenID Connect provider.
ja_jp: `quarkus-oidc` には、ベアラートークンを検証したり、認可コードフローでエンドユーザーを認証したりできる Keycloak などの OpenID Connect プロバイダーが必要です。 どちらの場合も、 `quarkus-oidc` は指定された OpenID Connect プロバイダーへの接続を必要とします。

source: `quarkus-oidc` supports a non-standard `client_secret_post_jwt` authentication method which can be configured as follows:
ja_jp: `quarkus-oidc` は、以下のように設定できる標準外の `client_secret_post_jwt` 認証方法をサポートしています。

source: `quarkus-reactive-db2-client`: link:https://vertx.io/docs/vertx-db2-client/java[the client for IBM Db2]
ja_jp: `quarkus-reactive-db2-client`: link:https://vertx.io/docs/vertx-db2-client/java[IBM Db2 のクライアント]

source: `quarkus-reactive-mssql-client`: link:https://vertx.io/docs/vertx-mssql-client/java[the client for Microsoft SQL Server]
ja_jp: `quarkus-reactive-mssql-client`: link:https://vertx.io/docs/vertx-mssql-client/java[Microsoft SQL Server のクライアント]

source: `quarkus-reactive-mysql-client`: link:https://vertx.io/docs/vertx-mysql-client/java[the client MySQL or MariaDB]
ja_jp: `quarkus-reactive-mysql-client`: link:https://vertx.io/docs/vertx-mysql-client/java[MySQL または MariaDBのクライアント]

source: `quarkus-reactive-oracle-client`: link:https://vertx.io/docs/vertx-oracle-client/java[the client for Oracle]
ja_jp: `quarkus-reactive-oracle-client`: link:https://vertx.io/docs/vertx-oracle-client/java[Oracleのクライアント]

source: `quarkus-reactive-pg-client`: link:https://vertx.io/docs/vertx-pg-client/java[the client for PostgreSQL or CockroachDB]
ja_jp: `quarkus-reactive-pg-client`: link:https://vertx.io/docs/vertx-pg-client/java[PostgreSQLやCockroachDBのクライアント]

source: `quarkus-redis`: Uses the xref:redis-reference.adoc[`quarkus-redis-client`] extension to persist processing states. Jackson is used to serialize processing state in Json. For complex objects it is required to configure the `checkpoint.state-type` property with the class name of the object. By default, the state store uses the default redis client, but if a xref:redis-reference.adoc#default-and-named-clients[named client] is to be used, the client name can be specified using the `mp.messaging.incoming.[channel-name].checkpoint.quarkus-redis.client-name` property. Processing states will be stored in Redis using the key naming scheme `[consumer-group-id]:[topic]:[partition]`.
ja_jp: `quarkus-redis`: 処理ステートを永続化するために xref:redis-reference.adoc[`quarkus-redis-client`] エクステンションを使用します。 Jackson は、処理ステートを Json でシリアル化するために使用されます。複雑なオブジェクトの場合は、オブジェクトのクラス名を使用して `checkpoint.state-type` プロパティーを設定する必要があります。 デフォルトでは、ステートストアはデフォルトの redis クライアントを使用しますが、xref:redis-reference.adoc#default-and-named-clients[名前付きクライアント] を使用する場合は、 `mp.messaging.incoming.[channel-name].checkpoint.quarkus-redis.client-name` プロパティーを使用してクライアント名を指定できます。 処理ステートは、キー命名スキーム `[consumer-group-id]:[topic]:[partition]` を使用して Redis に保存されます。

source: `quarkus-rest-client-oidc-filter` extension provides `io.quarkus.oidc.client.filter.OidcClientRequestReactiveFilter`.
ja_jp: `quarkus-rest-client-oidc-filter` エクステンションは、 `io.quarkus.oidc.client.filter.OidcClientRequestReactiveFilter` を提供します。

source: `quarkus-resteasy-client-oidc-filter` extension provides `io.quarkus.oidc.client.filter.OidcClientRequestFilter` Jakarta REST ClientRequestFilter which uses `OidcClient` to acquire the access token, refresh it if needed, and set it as an HTTP `Authorization Bearer` scheme value.
ja_jp: `quarkus-resteasy-client-oidc-filter` エクステンションは、 `io.quarkus.oidc.client.filter.OidcClientRequestFilter` Jakarta REST ClientRequestFilter を提供し、 `OidcClient` を使用してアクセストークンを取得し、必要に応じて更新し、HTTP `Authorization Bearer` スキーム値として設定します。

source: `quarkus-resteasy-client-oidc-filter` extension provides `io.quarkus.oidc.client.resteasy.filter.OidcClientRequestFilter`, a Jakarta REST `ClientRequestFilter` that uses `OidcClient` to acquire the access token, refresh it if needed, and set it as an HTTP `Authorization Bearer` scheme value.
ja_jp: `quarkus-resteasy-client-oidc-filter` エクステンションは、`OidcClient` を使用してアクセストークンを取得し、必要に応じて更新し、HTTP `Authorization Bearer` スキーム値として設定する Jakarta REST `ClientRequestFilter` である `io.quarkus.oidc.client.resteasy.filter.OidcClientRequestFilter` を提供します。

source: `quarkus-smallrye-jwt` can handle locally not only signed but also inner-signed-and-encrypted or only encrypted tokens. In fact `quarkus-oidc` and `quarkus-elytron-security-oauth2` can verify such tokens too but only by treating them as opaque tokens and verifying them via the remote introspection.
ja_jp: `quarkus-smallrye-jwt` は、署名されたトークンだけでなく、内部署名と暗号化されたトークン、または暗号化されたトークンをローカルに扱うことができます。実際、 `quarkus-oidc` と `quarkus-elytron-security-oauth2` はそのようなトークンも検証できますが、それらを不透明なトークンとして扱い、リモートイントロスペクションを介して検証することによってのみ可能です。

source: `quarkus-smallrye-jwt` does not support the remote introspection of the opaque tokens or even JWT tokens - it always relies on the locally available keys - possibly fetched from the OpenID Connect provider. So if you need to introspect the JWT tokens remotely then both `quarkus-oidc` and `quarkus-elytron-security-oauth2` will work. Both extensions also support the verification of the opaque/binary tokens via the remote introspection.
ja_jp: `quarkus-smallrye-jwt` は、不透明なトークンや JWT トークンのリモートイントロスペクションをサポートしていません。これは常に、ローカルで利用可能なキー (おそらく OpenID Connect プロバイダーから取得されたもの) に依存します。したがって、JWT トークンをリモートでイントロスペクションする必要がある場合は、 `quarkus-oidc` と `quarkus-elytron-security-oauth2` の両方が機能します。どちらのエクステンションも、リモートイントロスペクションによる不透明/バイナリトークンの検証もサポートしています。

source: `quarkus-smallrye-jwt` extension uses link:https://github.com/smallrye/smallrye-jwt[SmallRye JWT] library which is currently not reactive.
ja_jp: `quarkus-smallrye-jwt` エクステンションでは、現在リアクティブではない link:https://github.com/smallrye/smallrye-jwt[SmallRye JWT] ライブラリを使用します。

source: `quarkus-smallrye-jwt` handles locally signed, inner-signed-and-encrypted, and encrypted tokens. In contrast, although `quarkus-oidc` and `quarkus-elytron-security-oauth2` can also verify such tokens, they treat them as opaque tokens and verify them through remote introspection.
ja_jp: `quarkus-smallrye-jwt` は、ローカルで署名されたトークン、内部で署名および暗号化されたトークン、および暗号化されたトークンを処理します。 対照的に、 `quarkus-oidc` と `quarkus-elytron-security-oauth2` もそのようなトークンを検証できますが、それらを不透明トークンとして扱い、リモートイントロスペクションを通じて検証します。

source: `quarkus-smallrye-jwt` handles locally signed, inner-signed-and-encrypted, and encrypted tokens. While `quarkus-oidc` and `quarkus-elytron-security-oauth2` can also verify such tokens but treats them as opaque tokens and verifies them through remote introspection.
ja_jp: `quarkus-smallrye-jwt` は、ローカルで署名されたトークン、内部で署名および暗号化されたトークン、暗号化されたトークンを扱います。 `quarkus-oidc` や `quarkus-elytron-security-oauth2` もこのようなトークンを検証することもできますが、不透明なトークンとして扱い、リモートのイントロスペクションを通じて検証します。

source: `quarkus-smallrye-jwt` is an alternative to the `quarkus-oidc` Bearer Token authentication mechanism, and verifies only `JWT` tokens by using either PEM keys or the refreshable `JWK` key set. `quarkus-smallrye-jwt` also provides the JWT generation API, which you can use to easily create `signed`, `inner-signed`, and `encrypted` `JWT` tokens.
ja_jp: `quarkus-smallrye-jwt` は、 `quarkus-oidc` ベアラートークン認証メカニズムの代替となるもので、PEMキーまたはリフレッシュ可能な `JWK` キーセットを使用して、 `JWT` トークンだけを検証します。 `quarkus-smallrye-jwt` は、JWT生成APIも提供しており、これを使用して、 `signed` あるいは `inner-signed` 、 `encrypted` `JWT` トークンを簡単に作成できます。

source: `quarkus-smallrye-jwt` is an alternative to the `quarkus-oidc` Bearer token authentication mechanism and verifies only `JWT` tokens by using either Privacy Enhanced Mail (PEM) keys or the refreshable `JWK` key set. `quarkus-smallrye-jwt` also provides the JWT generation API, which you can use to easily create `signed`, `inner-signed`, and `encrypted` `JWT` tokens.
ja_jp: `quarkus-smallrye-jwt` は `quarkus-oidc` ベアラートークン認証メカニズムの代替となるもので、Privacy Enhanced Mail (PEM) キーまたは更新可能な `JWK` キーセットのいずれかを使用して `JWT` トークンのみを検証します。 `quarkus-smallrye-jwt` は JWT 生成 API も提供しており、これを使用して `signed`、 `inner-signed`、および `encrypted` の `JWT` トークンを簡単に作成できます。

source: `quarkus-smallrye-jwt` provides Microprofile JWT 1.1.1 implementation and many more options to verify signed and encrypted `JWT` tokens and represent them as `org.eclipse.microprofile.jwt.JsonWebToken`.
ja_jp: `quarkus-smallrye-jwt` はMicroprofile JWT 1.1.1.1 の実装と、署名・暗号化された `JWT` トークンを検証し、 `org.eclipse.microprofile.jwt.JsonWebToken` として表現するための多くのオプションを提供します。

source: `quarkus-smallrye-jwt` supports more key formats than `quarkus-oidc`. `quarkus-oidc` uses only the JWK-formatted keys that are part of a JWK set, whereas `quarkus-smallrye-jwt` supports PEM keys.
ja_jp: `quarkus-smallrye-jwt` は `quarkus-oidc` よりも多くの鍵フォーマットをサポートしています。 `quarkus-oidc` は JWK セットの一部である JWK 形式の鍵のみを使用するのに対し、 `quarkus-smallrye-jwt` は PEM 鍵をサポートしています。

source: `quarkus-smallrye-jwt` supports more key formats than `quarkus-oidc`. The latter will only use the JWK-formatted keys which are part of a JWK set. The former - can also work with PEM keys.
ja_jp: `quarkus-smallrye-jwt` は `quarkus-oidc` よりも多くのキーフォーマットをサポートしています。後者は、JWKセットの一部であるJWKフォーマットの鍵のみを使用します。前者では、PEMキーも使用可能です。

source: `quarkus-spring-web` needs to be complemented with either `quarkus-rest-jackson` or `quarkus-resteasy-jackson` in order to work.
ja_jp: `quarkus-spring-web` は、 `quarkus-rest-jackson` または `quarkus-resteasy-jackson` と共に使用する必要があります。

source: `quarkus-spring-web` needs to be complemented with either `quarkus-resteasy-jackson` or `quarkus-resteasy-reactive-jackson` in order to work.
ja_jp: `quarkus-spring-web` は、 `quarkus-resteasy-jackson` または `quarkus-resteasy-reactive-jackson` のどちらかで補完される必要があります。

source: `quarkus-spring-web` needs to be complemented with either `quarkus-resteasy-reactive-jackson` or `quarkus-resteasy-jackson` in order to work.
ja_jp: `quarkus-spring-web` は、 `quarkus-resteasy-jackson` または `quarkus-resteasy-reactive-jackson` のいずれかで補完されないと動作しません。

source: `quarkus-test-keycloak-server` provides a utility class `io.quarkus.test.keycloak.client.KeycloakTestClient` for acquiring the realm specific access tokens and which you can use with `RestAssured` for testing the `/{tenant}/bearer` endpoint expecting bearer access tokens. `HtmlUnit` is used for testing the `/{tenant}` endpoint and the authorization code flow.
ja_jp: `quarkus-test-keycloak-server` は、レルム固有のアクセストークンを取得するためのユーティリティクラス `io.quarkus.test.keycloak.client.KeycloakTestClient` を提供し、 `RestAssured` と共にベアラアクセストークンを期待する `/{tenant}/bearer` エンドポイントのテストに使用できます。 `HtmlUnit` は `/{tenant}` エンドポイントと認可コードフローのテストに使用します。

source: `quarkus-test-keycloak-server` provides a utility class `io.quarkus.test.keycloak.client.KeycloakTestClient` for acquiring the realm specific access tokens and which you can use with `RestAssured` for testing the `/{tenant}/bearer` endpoint expecting bearer access tokens. `HtmlUnit` tests the `/{tenant}` endpoint and the authorization code flow.
ja_jp: `quarkus-test-keycloak-server` は、レルム固有のアクセストークンを取得するためのユーティリティクラス `io.quarkus.test.keycloak.client.KeycloakTestClient` を提供します。これは、ベアラアクセストークンを想定する `/{tenant}/bearer` エンドポイントのテストに `RestAssured` と共に使用できます。 `HtmlUnit` は、`/{tenant}` エンドポイントと認可コードフローをテストします。

source: `quarkus.amqp.devservices.enabled` is set to `false`
ja_jp: `quarkus.amqp.devservices.enabled` が `false` に設定されている場合

source: `quarkus.apicurio-registry.devservices.enabled` is set to `false`
ja_jp: `quarkus.apicurio-registry.devservices.enabled` が `false` に設定されていること

source: `quarkus.cassandra.metrics.node.enabled` should contain the node-level metrics to enable (metrics for which each node contacted by the Cassandra client gets its own metric value).
ja_jp: `quarkus.cassandra.metrics.node.enabled` には、有効にするノードレベルのメトリクス (Cassandra クライアントが接続する各ノードが独自のメトリクス値を取得するメトリクス) が含まれている必要があります 。

source: `quarkus.cassandra.metrics.session.enabled` should contain the session-level metrics to enable (metrics that are global to the session).
ja_jp: `quarkus.cassandra.metrics.session.enabled` には、有効にするセッションレベルのメトリクス (セッションに対してグローバルなメトリクス) が含まれている必要があります。

source: `quarkus.config-tracking.directory` - directory in which the configuration dump should be stored, the default is `${project.basedir}/.quarkus`
ja_jp: `quarkus.config-tracking.directory` - 設定ダンプが保存されるディレクトリ、デフォルトは `${project.basedir}/.quarkus`

source: `quarkus.config-tracking.file-prefix` - file name prefix, the default value is `quarkus`
ja_jp: `quarkus.config-tracking.file-prefix` - ファイル名のプレフィックス、デフォルト値は `quarkus`

source: `quarkus.config-tracking.file-suffix` - file name suffix, the default value is `-config-dump`
ja_jp: `quarkus.config-tracking.file-suffix` - ファイル名のサフィックス、デフォルト値は `-config-dump`

source: `quarkus.config-tracking.file` - path to a file in which the configuration dump should be stored. This option supersedes the `file-prefix` and `file-suffix` options. Also supersedes the value of `quarkus.config-tracking.directory`, unless the value is a relative path.
ja_jp: `quarkus.config-tracking.file` - 設定ダンプを保存するファイルへのパス。このオプションは `file-prefix` と `file-suffix` のオプションに優先します。また、値が相対パスでない限り、 `quarkus.config-tracking.directory` の値にも優先します。

source: `quarkus.container-image.build=true` instructs Quarkus to create a container-image using the final application artifact (which is the native executable in this case)
ja_jp: `quarkus.container-image.build=true` 最終的なアプリケーションアーティファクト(この場合はネイティブ実行可能ファイル)を使用してコンテナーイメージを作成するようにQuarkusに指示します。

source: `quarkus.datasource._<datasource-name>_.jdbc.transactions` for named datasource
ja_jp: `quarkus.datasource._<datasource-name>_.jdbc.transactions` (名前付きデータソースの場合)

source: `quarkus.datasource.jdbc.tracing` is a build time configuration property: it makes sure all the tracing infrastructure is included in your application.
ja_jp: `quarkus.datasource.jdbc.tracing` は、ビルド時設定プロパティです。すべてのトレース基盤がアプリケーションに含まれていることを確認します。

source: `quarkus.datasource.jdbc.transactions` for default unnamed datasource
ja_jp: `quarkus.datasource.jdbc.transactions` (デフォルトの無名データソースの場合)

source: `quarkus.debug.generated-classes-dir` - to dump the generated classes, such as bean metadata
ja_jp: `quarkus.debug.generated-classes-dir` - Beanのメタデータのような、生成されたクラスをダンプします

source: `quarkus.debug.generated-sources-dir` - to dump the ZIG files; ZIG file is a textual representation of the generated code that is referenced in the stack traces
ja_jp: `quarkus.debug.generated-sources-dir` - ZIG ファイルをダンプします。ZIG ファイルは、スタックトレースで参照される生成されたコードのテキスト表現です。

source: `quarkus.debug.transformed-classes-dir` - to dump the transformed classes, e.g. Panache entities
ja_jp: `quarkus.debug.transformed-classes-dir` - Panache エンティティのような、変換されたクラスをダンプします

source: `quarkus.devservices.enabled` is set to `false`.
ja_jp: `quarkus.devservices.enabled` が `false` に設定されている場合

source: `quarkus.elasticsearch.devservices.enabled` is set to `false`
ja_jp: `quarkus.elasticsearch.devservices.enabled` が `false` に設定されている場合

source: `quarkus.flyway.baseline-on-migrate` will be set, telling Flyway to automatically create its baseline tables
ja_jp: `quarkus.flyway.baseline-on-migrate` が設定され、Flyway がベースラインとなるテーブルを自動的に作成するようになります。

source: `quarkus.flyway.migrate-at-start` will be set, telling Flyway to automatically apply migrations on application startup
ja_jp: `quarkus.flyway.migrate-at-start` が設定され、アプリケーションの起動時に Flyway が自動的にマイグレーションを適用するようになります。

source: `quarkus.funqy.knative-events.mapping.{function name}.resource-source` sets the Cloud Event source of the response
ja_jp: `quarkus.funqy.knative-events.mapping.{function name}.resource-source` は、レスポンスの Cloud Event のソースを設定します。

source: `quarkus.funqy.knative-events.mapping.{function name}.response-type` sets the Cloud Event type of the response
ja_jp: `quarkus.funqy.knative-events.mapping.{function name}.response-type` は、レスポンスの Cloud Event タイプを設定します。

source: `quarkus.funqy.knative-events.mapping.{function name}.trigger` sets the Cloud Event type that triggers a specific function. It is possible to use the special value `*` as a catch-all value. The function will in this case be used for all event types.
ja_jp: `quarkus.funqy.knative-events.mapping.{function name}.trigger` は、特定の関数をトリガーする Cloud Event タイプを設定します。特別な値 `*` をキャッチオール値として使用することができます。 この場合、この関数はすべてのイベントタイプに使用されます。

source: `quarkus.hibernate-orm.database.default-catalog` and `quarkus.hibernate-orm.database.default-schema` can now be set at runtime (they were fixed at build time until now).
ja_jp: `quarkus.hibernate-orm.database.default-catalog` と `quarkus.hibernate-orm.database.default-schema` を実行時に設定できるようになりました（これまではビルド時に固定されていました）。

source: `quarkus.hibernate-orm.sql-load-script` is set to `no-file` for all profiles except the `dev` and `test` ones.
ja_jp: `dev` と `test` 以外のプロフィールは `quarkus.hibernate-orm.sql-load-script` が `no-file` に設定されています。

source: `quarkus.http.non-application-root-path` - The non-application endpoint root path.
ja_jp: `quarkus.http.non-application-root-path` - アプリケーション以外のエンドポイントのルートパス。

source: `quarkus.http.port` is 9090
ja_jp: `quarkus.http.port` は 9090 です

source: `quarkus.http.root-path` - The HTTP root path. All web content is served relative to this root path.
ja_jp: `quarkus.http.root-path` - HTTP ルートパス。すべてのウェブコンテンツはこのルートパスからの相対パスで提供されます。

source: `quarkus.http.root-path` is only used for the main HTTP server. If you enabled the management interface (using the `quarkus.management.enabled=true` property), you can configure the root path of the management interface using: `quarkus.management.root-path`.
ja_jp: `quarkus.http.root-path` は、メインの HTTP サーバーにのみ使用されます。マネジメントインターフェイスを有効にした場合（ `quarkus.management.enabled=true` プロパティを使用）、マネジメントインターフェイスのルートパスは、次のように設定できます: `quarkus.management.root-path` 。

source: `quarkus.http.ssl-port` is 9443
ja_jp: `quarkus.http.ssl-port` は 9443 です

source: `quarkus.infinispan-client.devservices.enabled` is set to `false`
ja_jp: `quarkus.infinispan-client.devservices.enabled` が `false` に設定されている

source: `quarkus.kafka.devservices.enabled` is set to `false`
ja_jp: `quarkus.kafka.devservices.enabled` が `false` に設定されている場合

source: `quarkus.kogito.devservices.enabled` is set to `false`
ja_jp: `quarkus.kogito.devservices.enabled` が `false` にセットされていること

source: `quarkus.kubernetes-client.devservices.enabled` is set to `false`
ja_jp: `quarkus.kubernetes-client.devservices.enabled` が `false` に設定されている場合

source: `quarkus.kubernetes-client.devservices.manifests` only supports manifests. If you want to deploy a helm chart, you can use the `k3s` flavor and deploy a `HelmChart` manifest. See https://docs.k3s.io/helm for more information on how to use helm charts with k3s.
ja_jp: `quarkus.kubernetes-client.devservices.manifests` はマニフェストのみをサポートします。Helm チャートをデプロイしたい場合は、`k3s` flavor を使用して `HelmChart` マニフェストをデプロイできます。k3s で Helm チャートを使用する方法の詳細については、 link:https://docs.k3s.io/helm[こちら] を参照してください。

source: `quarkus.kubernetes.env-vars` are deprecated (though still currently supported as of this writing) and the new declaration style should be used instead. See <<#env-vars>> and more specifically <<env-vars-backwards>> for more details.
ja_jp: `quarkus.kubernetes.env-vars` は非推奨です(この記事を書いている時点ではまだサポートされていますが)ので、代わりに新しい宣言スタイルを使うべきです。詳細は link:#env-vars[[env-vars]] とより具体的には link:#env-vars-backwards[[env-vars-backwards] ] を参照してください。
